[
{"yield": "Probing the intersection of crypto and government."},
{"yield": "What financial advisors need to know about crypto."},
{"yield": "By signing up, you will receive emails about CoinDesk products and you agree to our"},
{"yield": "Kyle Davies, left, and Su Zhu, right (Kyle Davies/Twitter)"},
{"yield": "OPNX, the bankruptcy claims exchange tied to the founders of defunct hedge fund Three Arrows Capital, has filed a defamation lawsuit against venture capitalist Mike Dudas, according to Three Arrows co-founder Kyle Davies and New York State court records."},
{"yield": "In a summons notice filed in early June, OPNX alleged Dudas published defamatory comments about the company between February and March 2023, around the time that Davies and his partner Su Zhu unveiled their exchange venture. The document does not specify what Dudas’ defamatory comments were."},
{"yield": "Dudas, a well-known persona in the cryptocurrency industry, runs 6th Man Ventures and formerly helmed The Block, a crypto media outlet."},
{"yield": "“Along with my colleagues at Brown Rudnick, we are proud to represent Mike Dudas in defense of this lawsuit filed by 3 Arrows Capital’s ‘ecosystem partner’ OPNX,” crypto attorney Stephen Palley told CoinDesk. “In order to prove defamation you have to show, among other things, reputational damage. We look forward to seeing how the plaintiff plans to prove that in this case.”"},
{"yield": "The lawsuit comes as OPNX debuts a new “meme token” called Justice tokens (JT) that it says might benefit crypto communities who have been “harmed by defamation” by giving them a slice of settlements. Earlier this month it launched the first such token called $DUDAS."},
{"yield": ", OPNX describes JTs as worthless “meme tokens with no intrinsic value, no backing and no expectation of return.” OPNX can “at its sole discretion” decide to gift the proceeds of defamation settlements to some owners of JT tokens: OX token stakers (OX is the native token of OPNX), and also owners of the Miladies NFT."},
{"yield": "Miladies NFT owners have suffered “long term defamation” and deserve some upside via JT because of their “persistent promotion of moral virtue in an era where the majority pander to social media algorithms,” according to the white paper."},
{"yield": "“Initial JTs will focus on OPNX-specific defamation, then expand to non-OPNX cases,” Davies told CoinDesk."},
{"yield": "There are currently 43 wallets holding the DUDAS tokens, according to "},
{"yield": ", although there is insufficient liquidity to trade them on Uniswap."},
{"yield": "OPNX posited in the white paper that defamation cases in the crypto industry negatively impact entire communities of token holders; these communities should therefore benefit from “any settlements.” Justice tokens can be a “mechanism” to get that value to anyone impacted."},
{"yield": "The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a"},
{"yield": "CoinDesk is an independent operating subsidiary of"},
{"yield": "As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of"},
{"yield": "which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG"},
{"yield": "Oliver Knight is a CoinDesk reporter based between London and Lisbon. He does not own any crypto."},
{"yield": "Danny is CoinDesk's Managing Editor for Data & Tokens. He owns BTC, ETH and SOL."},
{"yield": ", CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to"},
{"yield": "The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a"},
{"yield": "CoinDesk is an independent operating subsidiary of"},
{"yield": "As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of"},
{"yield": "which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG"},
{"yield": "Probing the intersection of crypto and government."},
{"yield": "What financial advisors need to know about crypto."},
{"yield": "By signing up, you will receive emails about CoinDesk products and you agree to our"},
{"yield": " outside the U.S. has positioned the one-time Abu Dhabi regulator as the most likely successor to Changpeng Zhao, who founded the world’s largest crypto exchange in 2017."},
{"yield": " that Zhao, commonly known as CZ, is looking to reduce his ownership of "},
{"yield": ", the firm's American arm – a move that's seen as something of an appeasement to U.S. regulators."},
{"yield": "Teng's knowledge and experience as a regulator will come to bear in his new role overseeing Asia, Europe, the Middle East and North Africa as the exchange, often targeted by authorities, attempts to draw a line under mounting "},
{"yield": " related to conduct during crypto’s early years. Prior to heading up the Financial Services Regulatory Authority at Abu Dhabi Global Market (ADGM), he was chief regulatory officer of Singapore Exchange (SGX) and spent 13 years with the Monetary Authority of Singapore (MAS)."},
{"yield": "In an interview, Teng sidestepped the idea that he’s being groomed to take the reins from the 46-year-old CEO."},
{"yield": "“To speculate on such things would be premature,” Teng, 52, told CoinDesk. “Let me just stress we have a very strong management team in place and many strong leaders looking after different parts of business. I’m just happy to be part of that and to try and support the company’s agenda and aspirations.”"},
{"yield": "His new role, he pointed out, is not even a promotion, “just expanded responsibility to help [CZ] look at certain things.”"},
{"yield": " when he hired Teng back in August 2021. Teng initially joined Binance as CEO of the Singapore business, and quickly rose through the ranks during a turbulent period in the digital assets sector."},
{"yield": "A former Binance employee, who asked to remain anonymous, told CoinDesk via direct message: “Both senior leadership and regulators have discussed behind closed doors that Richard Teng is the only leader that could step into CZ’s shoes and both continue building the company in his vision while helping bridge the existing gap between the industry and regulators.”"},
{"yield": "Teng believes Binance is “open and candid about things in the past,” pointing out the firm is still very young. Binance, which will soon celebrate its sixth birthday, started as a technology firm, Teng said, at a point in time when most jurisdictions had no regulations or proper guidance. Today, it has some 750 compliance officers, more than any other exchange, he added."},
{"yield": "“If you look at the past 18 to 24 months, the company has pivoted very strongly in terms of the direction of travel on compliance,” Teng said. “But we acknowledge there are past issues. We want to solve all those policy issues in a responsible manner with the respective parties and move on to demonstrate that we are a new organization.”"},
{"yield": "Meanwhile, crypto continues to evolve, both in its technological development and in terms of tectonic shifts at a level of jurisdictions. In that global context, it could be argued that a clampdown from U.S. regulators will see crypto hubs sprout and flourish elsewhere."},
{"yield": "The ambition to set up a dedicated crypto regulatory agency is demonstrated in Dubai, for example, Teng said. Europe is also striding ahead with its Markets in Crypto Assets (MiCA) regulatory framework, "},
{"yield": "“If you look at what Paris is doing, it is very conducive for businesses. Not only ourselves, a number of crypto players are trying to use Paris as their base for expansion within Europe,” Teng said."},
{"yield": "He also said Binance is “excited” about Hong Kong opening up to crypto trading and offering licenses to firms. Asked if Binance is underway setting up shop in the territory, he said: “That’s an announcement we will make when the time comes.”"},
{"yield": "The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a"},
{"yield": "CoinDesk is an independent operating subsidiary of"},
{"yield": "As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of"},
{"yield": "which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG"},
{"yield": "Ian Allison is an award-winning senior reporter at CoinDesk. He holds ETH."},
{"yield": ", CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to"},
{"yield": "The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a"},
{"yield": "CoinDesk is an independent operating subsidiary of"},
{"yield": "As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of"},
{"yield": "which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG"}
]